HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCan_reg.h
/** \brief 300, TT Trigger Memory Configuration 0 */
#define CAN0_N0_TT_TMC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_TMC*)0xF0208300u)
/** Alias (User Manual Name) for CAN0_N0_TT_TMC.
* To use register names with standard convension, please use CAN0_N0_TT_TMC.
*/
#define CAN0_TTTMC0 (CAN0_N0_TT_TMC)

/** \brief 304, TT Reference Message Configuration 0 */
#define CAN0_N0_TT_RMC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_RMC*)0xF0208304u)
/** Alias (User Manual Name) for CAN0_N0_TT_RMC.
* To use register names with standard convension, please use CAN0_N0_TT_RMC.
*/
#define CAN0_TTRMC0 (CAN0_N0_TT_RMC)

/** \brief 308, TT Operation Configuration 0 */
#define CAN0_N0_TT_OCF /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_OCF*)0xF0208308u)
/** Alias (User Manual Name) for CAN0_N0_TT_OCF.
* To use register names with standard convension, please use CAN0_N0_TT_OCF.
*/
#define CAN0_TTOCF0 (CAN0_N0_TT_OCF)

/** \brief 30C, TT Matrix Limits 0 */
#define CAN0_N0_TT_MLM /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_MLM*)0xF020830Cu)
/** Alias (User Manual Name) for CAN0_N0_TT_MLM.
* To use register names with standard convension, please use CAN0_N0_TT_MLM.
*/
#define CAN0_TTMLM0 (CAN0_N0_TT_MLM)

/** \brief 310, TUR Configuration 0 */
#define CAN0_N0_TT_TURCF /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_TURCF*)0xF0208310u)
/** Alias (User Manual Name) for CAN0_N0_TT_TURCF.
* To use register names with standard convension, please use CAN0_N0_TT_TURCF.
*/
#define CAN0_TURCF0 (CAN0_N0_TT_TURCF)

/** \brief 314, TT Operation Control 0 */
#define CAN0_N0_TT_OCN /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_OCN*)0xF0208314u)
/** Alias (User Manual Name) for CAN0_N0_TT_OCN.
* To use register names with standard convension, please use CAN0_N0_TT_OCN.
*/
#define CAN0_TTOCN0 (CAN0_N0_TT_OCN)

/** \brief 318, TT Global Time Preset 0 */
#define CAN0_N0_TT_GTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_GTP*)0xF0208318u)
/** Alias (User Manual Name) for CAN0_N0_TT_GTP.
* To use register names with standard convension, please use CAN0_N0_TT_GTP.
*/
#define CAN0_TTGTP0 (CAN0_N0_TT_GTP)

/** \brief 31C, TT Time Mark 0 */
#define CAN0_N0_TT_TMK /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_TMK*)0xF020831Cu)
/** Alias (User Manual Name) for CAN0_N0_TT_TMK.
* To use register names with standard convension, please use CAN0_N0_TT_TMK.
*/
#define CAN0_TTTMK0 (CAN0_N0_TT_TMK)

/** \brief 320, TT Interrupt Register 0 */
#define CAN0_N0_TT_IR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_IR*)0xF0208320u)
/** Alias (User Manual Name) for CAN0_N0_TT_IR.
* To use register names with standard convension, please use CAN0_N0_TT_IR.
*/
#define CAN0_TTIR0 (CAN0_N0_TT_IR)

/** \brief 324, TT Interrupt Enable 0 */
#define CAN0_N0_TT_IE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_IE*)0xF0208324u)
/** Alias (User Manual Name) for CAN0_N0_TT_IE.
* To use register names with standard convension, please use CAN0_N0_TT_IE.
*/
#define CAN0_TTIE0 (CAN0_N0_TT_IE)

/** \brief 32C, TT Operation Status 0 */
#define CAN0_N0_TT_OST /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_OST*)0xF020832Cu)
/** Alias (User Manual Name) for CAN0_N0_TT_OST.
* To use register names with standard convension, please use CAN0_N0_TT_OST.
*/
#define CAN0_TTOST0 (CAN0_N0_TT_OST)

/** \brief 330, TUR Numerator Actual 0 */
#define CAN0_N0_TT_TURNA /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_TURNA*)0xF0208330u)
/** Alias (User Manual Name) for CAN0_N0_TT_TURNA.
* To use register names with standard convension, please use CAN0_N0_TT_TURNA.
*/
#define CAN0_TURNA0 (CAN0_N0_TT_TURNA)

/** \brief 334, TT Local & Global Time 0 */
#define CAN0_N0_TT_LGT /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_LGT*)0xF0208334u)
/** Alias (User Manual Name) for CAN0_N0_TT_LGT.
* To use register names with standard convension, please use CAN0_N0_TT_LGT.
*/
#define CAN0_TTLGT0 (CAN0_N0_TT_LGT)

/** \brief 338, TT Cycle Time & Count 0 */
#define CAN0_N0_TT_CTC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_CTC*)0xF0208338u)
/** Alias (User Manual Name) for CAN0_N0_TT_CTC.
* To use register names with standard convension, please use CAN0_N0_TT_CTC.
*/
#define CAN0_TTCTC0 (CAN0_N0_TT_CTC)

/** \brief 33C, TT Capture Time 0 */
#define CAN0_N0_TT_CPT /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_CPT*)0xF020833Cu)
/** Alias (User Manual Name) for CAN0_N0_TT_CPT.
* To use register names with standard convension, please use CAN0_N0_TT_CPT.
*/
#define CAN0_TTCPT0 (CAN0_N0_TT_CPT)

/** \brief 340, TT Cycle Sync Mark 0 */
#define CAN0_N0_TT_CSM /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TT_CSM*)0xF0208340u)
/** Alias (User Manual Name) for CAN0_N0_TT_CSM.
* To use register names with standard convension, please use CAN0_N0_TT_CSM.
*/
#define CAN0_TTCSM0 (CAN0_N0_TT_CSM)

/** \brief 500, Access Enable Register CAN Node 1 0 */
#define CAN0_N1_ACCENNODE0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ACCENNODE0*)0xF0208500u)
/** Alias (User Manual Name) for CAN0_N1_ACCENNODE0.
* To use register names with standard convension, please use CAN0_N1_ACCENNODE0.
*/
#define CAN0_ACCENNODE10 (CAN0_N1_ACCENNODE0)

/** \brief 508, Start Address Node 1 */
#define CAN0_N1_STARTADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0208508u)
/** Alias (User Manual Name) for CAN0_N1_STARTADR.
* To use register names with standard convension, please use CAN0_N1_STARTADR.
*/
#define CAN0_STARTADR1 (CAN0_N1_STARTADR)

/** \brief 50C, End Address Node 1 */
#define CAN0_N1_ENDADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDADR*)0xF020850Cu)
/** Alias (User Manual Name) for CAN0_N1_ENDADR.
* To use register names with standard convension, please use CAN0_N1_ENDADR.
*/
#define CAN0_ENDADR1 (CAN0_N1_ENDADR)

/** \brief 510, Interrupt Signalling Register 1 */
#define CAN0_N1_ISREG /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ISREG*)0xF0208510u)
/** Alias (User Manual Name) for CAN0_N1_ISREG.
* To use register names with standard convension, please use CAN0_N1_ISREG.
*/
#define CAN0_ISREG1 (CAN0_N1_ISREG)

/** \brief 514, Interrupt routing for Groups 1 1 */
#define CAN0_N1_GRINT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GRINT1*)0xF0208514u)
/** Alias (User Manual Name) for CAN0_N1_GRINT1.
* To use register names with standard convension, please use CAN0_N1_GRINT1.
*/
#define CAN0_GRINT11 (CAN0_N1_GRINT1)

/** \brief 518, Interrupt routing for Groups 2 1 */
#define CAN0_N1_GRINT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GRINT2*)0xF0208518u)
/** Alias (User Manual Name) for CAN0_N1_GRINT2.
* To use register names with standard convension, please use CAN0_N1_GRINT2.
*/
#define CAN0_GRINT21 (CAN0_N1_GRINT2)

/** \brief 520, Node 1 Timer Clock Control Register */
#define CAN0_N1_NT_CCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_CCR*)0xF0208520u)
/** Alias (User Manual Name) for CAN0_N1_NT_CCR.
* To use register names with standard convension, please use CAN0_N1_NT_CCR.
*/
#define CAN0_NTCCR1 (CAN0_N1_NT_CCR)

/** \brief 524, Node 1 Timer A Transmit Trigger Register */
#define CAN0_N1_NT_ATTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_ATTR*)0xF0208524u)
/** Alias (User Manual Name) for CAN0_N1_NT_ATTR.
* To use register names with standard convension, please use CAN0_N1_NT_ATTR.
*/
#define CAN0_NTATTR1 (CAN0_N1_NT_ATTR)

