HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCan_reg.h
/** \brief 30, Module Control Register */
#define CAN2_MCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_MCR*)0xF0228030u)

/** \brief DC, Access Enable Register Control 0 */
#define CAN2_ACCENCTR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_ACCENCTR0*)0xF02280DCu)

/** \brief E8, OCDS Control and Status */
#define CAN2_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_OCS*)0xF02280E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define CAN2_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_KRSTCLR*)0xF02280ECu)

/** \brief F0, Kernel Reset Register 1 */
#define CAN2_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_KRST1*)0xF02280F0u)

/** \brief F4, Kernel Reset Register 0 */
#define CAN2_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_KRST0*)0xF02280F4u)

/** \brief FC, Access Enable Register 0 */
#define CAN2_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_ACCEN0*)0xF02280FCu)

/** \brief 100, Access Enable Register CAN Node 0 0 */
#define CAN2_N0_ACCENNODE0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ACCENNODE0*)0xF0228100u)
/** Alias (User Manual Name) for CAN2_N0_ACCENNODE0.
* To use register names with standard convension, please use CAN2_N0_ACCENNODE0.
*/
#define CAN2_ACCENNODE00 (CAN2_N0_ACCENNODE0)

/** \brief 108, Start Address Node 0 */
#define CAN2_N0_STARTADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0228108u)
/** Alias (User Manual Name) for CAN2_N0_STARTADR.
* To use register names with standard convension, please use CAN2_N0_STARTADR.
*/
#define CAN2_STARTADR0 (CAN2_N0_STARTADR)

/** \brief 10C, End Address Node 0 */
#define CAN2_N0_ENDADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDADR*)0xF022810Cu)
/** Alias (User Manual Name) for CAN2_N0_ENDADR.
* To use register names with standard convension, please use CAN2_N0_ENDADR.
*/
#define CAN2_ENDADR0 (CAN2_N0_ENDADR)

/** \brief 110, Interrupt Signalling Register 0 */
#define CAN2_N0_ISREG /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ISREG*)0xF0228110u)
/** Alias (User Manual Name) for CAN2_N0_ISREG.
* To use register names with standard convension, please use CAN2_N0_ISREG.
*/
#define CAN2_ISREG0 (CAN2_N0_ISREG)

/** \brief 114, Interrupt routing for Groups 1 0 */
#define CAN2_N0_GRINT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GRINT1*)0xF0228114u)
/** Alias (User Manual Name) for CAN2_N0_GRINT1.
* To use register names with standard convension, please use CAN2_N0_GRINT1.
*/
#define CAN2_GRINT10 (CAN2_N0_GRINT1)

/** \brief 118, Interrupt routing for Groups 2 0 */
#define CAN2_N0_GRINT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GRINT2*)0xF0228118u)
/** Alias (User Manual Name) for CAN2_N0_GRINT2.
* To use register names with standard convension, please use CAN2_N0_GRINT2.
*/
#define CAN2_GRINT20 (CAN2_N0_GRINT2)

/** \brief 120, Node 0 Timer Clock Control Register */
#define CAN2_N0_NT_CCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_CCR*)0xF0228120u)
/** Alias (User Manual Name) for CAN2_N0_NT_CCR.
* To use register names with standard convension, please use CAN2_N0_NT_CCR.
*/
#define CAN2_NTCCR0 (CAN2_N0_NT_CCR)

/** \brief 124, Node 0 Timer A Transmit Trigger Register */
#define CAN2_N0_NT_ATTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_ATTR*)0xF0228124u)
/** Alias (User Manual Name) for CAN2_N0_NT_ATTR.
* To use register names with standard convension, please use CAN2_N0_NT_ATTR.
*/
#define CAN2_NTATTR0 (CAN2_N0_NT_ATTR)

/** \brief 128, Node 0 Timer B Transmit Trigger Register */
#define CAN2_N0_NT_BTTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_BTTR*)0xF0228128u)
/** Alias (User Manual Name) for CAN2_N0_NT_BTTR.
* To use register names with standard convension, please use CAN2_N0_NT_BTTR.
*/
#define CAN2_NTBTTR0 (CAN2_N0_NT_BTTR)

/** \brief 12C, Node 0 Timer C Transmit Trigger Register */
#define CAN2_N0_NT_CTTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_CTTR*)0xF022812Cu)
/** Alias (User Manual Name) for CAN2_N0_NT_CTTR.
* To use register names with standard convension, please use CAN2_N0_NT_CTTR.
*/
#define CAN2_NTCTTR0 (CAN2_N0_NT_CTTR)

/** \brief 130, Node 0 Timer Receive Timeout Register */
#define CAN2_N0_NT_RTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_RTR*)0xF0228130u)
/** Alias (User Manual Name) for CAN2_N0_NT_RTR.
* To use register names with standard convension, please use CAN2_N0_NT_RTR.
*/
#define CAN2_NTRTR0 (CAN2_N0_NT_RTR)

/** \brief 140, Node 0 Port Control Register */
#define CAN2_N0_NPCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NPCR*)0xF0228140u)
/** Alias (User Manual Name) for CAN2_N0_NPCR.
* To use register names with standard convension, please use CAN2_N0_NPCR.
*/
#define CAN2_NPCR0 (CAN2_N0_NPCR)

/** \brief 200, Core Release Register 0 */
#define CAN2_N0_CREL /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CREL*)0xF0228200u)
/** Alias (User Manual Name) for CAN2_N0_CREL.
* To use register names with standard convension, please use CAN2_N0_CREL.
*/
#define CAN2_CREL0 (CAN2_N0_CREL)

/** \brief 204, Endian Register 0 */
#define CAN2_N0_ENDN /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDN*)0xF0228204u)
/** Alias (User Manual Name) for CAN2_N0_ENDN.
* To use register names with standard convension, please use CAN2_N0_ENDN.
*/
#define CAN2_ENDN0 (CAN2_N0_ENDN)

/** \brief 20C, Data Bit Timing & Prescaler Register 0 */
#define CAN2_N0_DBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_DBTP*)0xF022820Cu)
/** Alias (User Manual Name) for CAN2_N0_DBTP.
* To use register names with standard convension, please use CAN2_N0_DBTP.
*/
#define CAN2_DBTP0 (CAN2_N0_DBTP)

/** \brief 210, Test Register 0 */
#define CAN2_N0_TEST /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TEST*)0xF0228210u)
/** Alias (User Manual Name) for CAN2_N0_TEST.
* To use register names with standard convension, please use CAN2_N0_TEST.
*/
#define CAN2_TEST0 (CAN2_N0_TEST)

/** \brief 214, RAM Watchdog 0 */
#define CAN2_N0_RWD /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RWD*)0xF0228214u)
/** Alias (User Manual Name) for CAN2_N0_RWD.
* To use register names with standard convension, please use CAN2_N0_RWD.
*/
#define CAN2_RWD0 (CAN2_N0_RWD)

/** \brief 218, CC Control Register 0 */
#define CAN2_N0_CCCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CCCR*)0xF0228218u)
/** Alias (User Manual Name) for CAN2_N0_CCCR.
* To use register names with standard convension, please use CAN2_N0_CCCR.
*/
#define CAN2_CCCR0 (CAN2_N0_CCCR)

/** \brief 21C, Nominal Bit Timing & Prescaler Register 0 */
#define CAN2_N0_NBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NBTP*)0xF022821Cu)
/** Alias (User Manual Name) for CAN2_N0_NBTP.
* To use register names with standard convension, please use CAN2_N0_NBTP.
*/
#define CAN2_NBTP0 (CAN2_N0_NBTP)

/** \brief 220, Timestamp Counter Configuration 0 */
#define CAN2_N0_TSCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCC*)0xF0228220u)
/** Alias (User Manual Name) for CAN2_N0_TSCC.
* To use register names with standard convension, please use CAN2_N0_TSCC.
*/
#define CAN2_TSCC0 (CAN2_N0_TSCC)

/** \brief 224, Timestamp Counter Value 0 */
#define CAN2_N0_TSCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCV*)0xF0228224u)
/** Alias (User Manual Name) for CAN2_N0_TSCV.
* To use register names with standard convension, please use CAN2_N0_TSCV.
*/
#define CAN2_TSCV0 (CAN2_N0_TSCV)

/** \brief 228, Timeout Counter Configuration 0 */
#define CAN2_N0_TOCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCC*)0xF0228228u)
/** Alias (User Manual Name) for CAN2_N0_TOCC.
* To use register names with standard convension, please use CAN2_N0_TOCC.
*/
#define CAN2_TOCC0 (CAN2_N0_TOCC)

